{
  "name": "Daniel Florencio",
  "title": "AI Engineer & Full-Stack Developer",
  "contact": {
    "email": "dmflorencio.main@gmail.com",
    "phone": "",
    "linkedin": "https://www.linkedin.com/in/dmflorencio/",
    "github": "https://github.com/DMcloud022",
    "location": "Philippines"
  },
  "summary": "AI Engineer and Full-Stack Developer with 2+ years of professional experience specializing in artificial intelligence, machine learning, and enterprise software solutions. Currently serving as an AI Engineer at the Department of Information and Communications Technology (DICT), focusing on AI/ML implementations, LLMs, RAG pipelines, and government IT systems. Proven track record in developing scalable web applications, HRMS platforms, and AI-powered solutions across telecommunications, FinTech, and government sectors. Expertise in Python, TensorFlow, Laravel, Vue.js, React, and modern AI frameworks. Strong background in system architecture, Docker containerization, Linux administration, and database design. Graduated Cum Laude in Computer Science with a specialization in Data Science. Passionate about leveraging cutting-edge AI technologies to solve complex problems and drive innovation in both public and private sectors.",
  "experience": [
    {
      "title": "AI Engineer",
      "company": "Department of Information and Communications Technology",
      "dates": "Nov 2025 - Present",
      "location": "Philippines",
      "description": []
    },
    {
      "title": "Software Developer",
      "company": "Coral System Technologies Inc.",
      "dates": "Feb 2025 - Nov 2025",
      "location": "Philippines",
      "description": [
        "Developed and maintained a comprehensive Human Resource Management System (HRMS) using Laravel and Vue.js, managing employee records, attendance tracking, payroll processing, and performance evaluations with RESTful API architecture.",
        "Led the maintenance and enhancement of a FreeSWITCH-based call center infrastructure serving multiple concurrent users, achieving high uptime and reducing call routing latency.",
        "Developed comprehensive CLI scripting solutions and automation workflows in a Linux environment, reducing manual system administration tasks and improving efficiency.",
        "Implemented Docker-based deployment pipelines that streamlined application delivery, reducing deployment time from hours to minutes.",
        "Architected and configured a Proxmox VE platform managing multiple virtual machines, implementing high-availability clustering that improved system resilience and resource utilization."
      ]
    },
    {
      "title": "Online Tutor",
      "company": "Freelance",
      "dates": "Nov 2024 - May 2025",
      "location": "Remote",
      "description": [
        "Delivered tailored tutoring sessions to students in Computer Science and Mathematics, resulting in significant grade improvement.",
        "Developed innovative teaching methodologies to explain complex concepts in algorithms, data structures, and advanced mathematics, receiving high student satisfaction."
      ]
    },
    {
      "title": "AI Developer & Junior Software Developer",
      "company": "Offshorly",
      "dates": "May 2024 - Oct 2024",
      "location": "Philippines",
      "description": [
        "Designed and implemented cutting-edge AI solutions integrating Large Language Models (LLMs) that automated repetitive tasks and improved workflow efficiency.",
        "Built scalable vector database solutions and Retrieval-Augmented Generation (RAG) pipelines, enhancing data accessibility and reducing information retrieval time.",
        "Collaborated with senior developers on multiple AI and web development projects, contributing to on-time delivery and maintaining high code quality standards."
      ]
    },
    {
      "title": "Software Developer (Internship)",
      "company": "Coreware Technologies, Inc.",
      "dates": "Feb 2024 - Mar 2024",
      "location": "Philippines",
      "description": [
        "Designed and developed a high-performance GUI for an ATM Switch Card Management system using Flutter for Windows, reducing transaction processing time.",
        "Collaborated with design teams using Figma to translate complex requirements into intuitive, responsive interfaces, improving user adoption."
      ]
    },
    {
      "title": "Full-stack Developer (Internship)",
      "company": "51st Engineer Brigade, Philippine Army",
      "dates": "Jan 2024 - May 2024",
      "location": "Philippines",
      "description": [
        "Co-designed and implemented a comprehensive Management Information System (MIS) serving military personnel, improving data accessibility and reducing administrative processing time.",
        "Streamlined organizational data management processes through advanced analytics and reporting capabilities, enabling data-informed decision-making that improved operational efficiency."
      ]
    }
  ],
  "education": [
    {
      "institution": "Technological Institute of the Philippines",
      "degree": "Bachelor of Science, Computer Science",
      "graduationDate": "Aug 2020 - Sep 2024",
      "details": [
        "Graduated with Cum Laude honors.",
        "Specialization in Data Science.",
        "Thesis: Designed and implemented a Convolutional Neural Network (CNN) for image classification, achieving a 95-98% accuracy rate.",
        "Relevant Coursework: Data Structures & Algorithms, Machine Learning, Artificial Intelligence, Database Systems, Software Engineering, Network Security."
      ]
    }
  ],
  "skills": [
    "Generative AI", "Large Language Models (LLMs)", "RAG Pipelines", "Vector Databases", "Convolutional Neural Networks (CNN)", "Scikit-learn", "TensorFlow", "Python", "Node.js", "REST API Design", "SQL (MySQL, PostgreSQL)", "JavaScript (ES6+)", "HTML5", "CSS3", "React", "Flutter", "Figma", "Linux Administration", "Docker", "Proxmox VE", "Bash Scripting", "FreeSWITCH", "Network Security"
  ],
  "projects": [
    {
      "name": "HRMS using Laravel and Vue",
      "technologies": ["Laravel", "Vue.js", "MySQL", "REST API", "PHP"],
      "description": "Developed a comprehensive Human Resource Management System using Laravel as the backend framework and Vue.js for the frontend interface. The system manages employee records, attendance tracking, payroll processing, leave management, and performance evaluations. Implemented RESTful API architecture for seamless communication between frontend and backend, with robust authentication and authorization mechanisms. Features include real-time data synchronization, responsive design for multi-device access, automated payroll calculations, and comprehensive reporting dashboards. Built with MySQL database for efficient data storage and retrieval, ensuring data integrity and optimal performance for enterprise-level operations."
    },
    {
      "name": "Image Classification System using Convolutional Neural Networks",
      "technologies": ["Python", "TensorFlow", "Keras", "CNN", "Deep Learning"],
      "description": "Designed and implemented an advanced image classification system utilizing Convolutional Neural Networks (CNNs) for accurate image recognition and categorization. Developed custom CNN architecture optimized for the specific dataset, incorporating techniques such as data augmentation, dropout regularization, and batch normalization to enhance model performance. The system processes and classifies images across multiple categories with high precision, demonstrating expertise in deep learning model architecture, training pipeline optimization, and evaluation metrics. Built with Python, TensorFlow, and Keras, implementing best practices for data preprocessing, model training, validation, and deployment."
    }
  ],
  "certifications": [
    {
      "title": "Human Skills in the Age of AI",
      "issuer": "Microsoft and LinkedIn",
      "date": "April 30, 2025"
    },
    {
      "title": "Career Essentials in Generative AI",
      "issuer": "Microsoft and LinkedIn",
      "date": "April 14, 2024"
    },
    {
      "title": "Career Essentials in Software Development",
      "issuer": "Microsoft and LinkedIn",
      "date": "April 1, 2024"
    },
    {
      "title": "Zendesk Customer Service Professional Certificate",
      "issuer": "Zendesk",
      "date": "April 22, 2024"
    }
  ]
} 